.bin/k6-async-1parts-15CCUs.log
    done [==========================================================] 15 / 15

    ✗ OK
     ↳  20% — ✓ 3 / ✗ 12

    checks.....................: 20.00% ✓ 3    ✗ 12
    data_received..............: 5.0 kB 855 B/s
    data_sent..................: 1.5 kB 259 B/s
    http_req_blocked...........: avg=1.13ms  min=0s    med=1ms   max=2ms   p(90)=2ms   p(95)=2ms
    http_req_connecting........: avg=1.06ms  min=0s    med=1ms   max=2ms   p(90)=2ms   p(95)=2ms
    http_req_duration..........: avg=5.52s   min=3.52s med=5.84s max=5.84s p(90)=5.84s p(95)=5.84s
    http_req_receiving.........: avg=66.81µs min=0s    med=0s    max=1ms   p(90)=0s    p(95)=300.65µs
    http_req_sending...........: avg=0s      min=0s    med=0s    max=0s    p(90)=0s    p(95)=0s
    http_req_tls_handshaking...: avg=0s      min=0s    med=0s    max=0s    p(90)=0s    p(95)=0s
    http_req_waiting...........: avg=5.52s   min=3.52s med=5.84s max=5.84s p(90)=5.84s p(95)=5.84s
    http_reqs..................: 15     2.567013/s
    iteration_duration.........: avg=5.52s   min=3.52s med=5.84s max=5.84s p(90)=5.84s p(95)=5.84s
    iterations.................: 15     2.567013/s
    vus........................: 15     min=15 max=15
    vus_max....................: 15     min=15 max=15

PRODUCER ---------------------------------- (FAILED 1, 2, 6, 7, 10, 13)
kafka_replyTopic:[B@44a0de29
kafka_correlationId:[B@575de62
__TypeId__:[B@3cb4d097
kafka_replyTopic:[B@12c700ad
kafka_replyTopic:[B@67085817
kafka_correlationId:[B@46b68702
__TypeId__:[B@5f149ca9
kafka_replyTopic:[B@27004263
kafka_correlationId:[B@455fbc05
kafka_replyTopic:[B@284465fc
kafka_replyTopic:[B@107d02ba
kafka_replyTopic:[B@751b3bf2
kafka_correlationId:[B@482c144f
kafka_replyTopic:[B@430d5d8b
kafka_replyTopic:[B@3d289298
kafka_replyTopic:[B@36a1414d
kafka_correlationId:[B@2ff811d4
__TypeId__:[B@58253c09
kafka_replyTopic:[B@275ddec
kafka_correlationId:[B@37af039f
kafka_replyTopic:[B@3293063d
kafka_correlationId:[B@6638533f
__TypeId__:[B@4ae44d6d
kafka_replyTopic:[B@68cfeece
kafka_replyTopic:[B@68cf5ab4
kafka_replyTopic:[B@5fc1391b
kafka_correlationId:[B@51da9503
kafka_correlationId:[B@6e7a0e98
__TypeId__:[B@4782cc29
__TypeId__:[B@43f1e4cb
kafka_correlationId:[B@790a1d2f
kafka_correlationId:[B@3c0c5292
__TypeId__:[B@3b202a80
__TypeId__:[B@243ae2ac
kafka_correlationId:[B@52ab2c80
kafka_correlationId:[B@3f328399
__TypeId__:[B@21ab4856
kafka_correlationId:[B@732ecdd2
__TypeId__:[B@4829c9b6
__TypeId__:[B@4139bdb4
__TypeId__:[B@14bbefdc
__TypeId__:[B@5a041917
kafka_correlationId:[B@6ab49362
__TypeId__:[B@34ee4ecf
__TypeId__:[B@3fb93eae
2019-09-07 18:00:27.335  INFO 24588 --- [io-2001-exec-10] io.project.resources.InfoController      : ASync-REQUEST[15]() 200: [REPLY-S1/1]  @(1567854026549)
2019-09-07 18:00:28.140  INFO 24588 --- [nio-2001-exec-1] io.project.resources.InfoController      : ASync-REQUEST[7]() 200: [REPLY-S2/2]  @(1567854028087)
2019-09-07 18:00:29.162  INFO 24588 --- [nio-2001-exec-7] io.project.resources.InfoController      : ASync-REQUEST[5]() 200: [REPLY-S3/3]  @(1567854029104)
2019-09-07 18:00:29.790  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [5, -90, -50, 125, 36, -88, 65, 112, -84, -4, -48, 108, 75, 28, -5, 35]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [7512249348684896201590100008852323107]
2019-09-07 18:00:29.792  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-119, 80, 70, 70, -125, -119, 76, 42, -125, -96, 20, 80, 41, -87, -126, 54]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-157761322394370052241853332072867200458]
2019-09-07 18:00:29.794  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-60, -1, -99, -102, -36, -23, 70, -80, -80, 76, 29, -89, -14, -26, 37, 44]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-78426447440355055118338155107367639764]
2019-09-07 18:00:29.796  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-54, -43, 82, 53, -106, -10, 64, 42, -111, 3, 27, 1, 105, -80, 111, -64]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-70670685138116975917449590312478412864]
2019-09-07 18:00:29.797  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [66, -57, 47, 85, 111, -71, 65, -46, -118, -39, 94, -27, -67, -15, -21, -92]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [88763274838874861855148239139787369380]
2019-09-07 18:00:29.799  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-42, -40, 20, -92, -121, 77, 71, -65, -103, 41, -65, -115, 62, 77, -3, 72]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-54705621018038316085060589515592303288]
2019-09-07 18:00:29.802  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [73, 107, 4, 26, 111, -93, 73, -11, -97, 96, 95, -101, -32, 115, -92, -107]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [97589302680282965518241470628593116309]
2019-09-07 18:00:29.803 ERROR 24588 --- [io-2001-exec-13] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.803 ERROR 24588 --- [nio-2001-exec-5] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.803 ERROR 24588 --- [nio-2001-exec-9] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.803 ERROR 24588 --- [nio-2001-exec-2] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.804 ERROR 24588 --- [io-2001-exec-11] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.804 ERROR 24588 --- [nio-2001-exec-6] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.807  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [31, -38, -65, 14, -101, -34, 78, 65, -86, -82, -88, -36, -38, 31, 81, -86]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [42341863682160484761975282554546114986]
2019-09-07 18:00:29.808 ERROR 24588 --- [io-2001-exec-14] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.825  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [15, 30, 123, -57, 122, 67, 79, 64, -98, 98, 88, 34, -97, 29, -122, -12]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [20096699383153915903553174691179759348]
2019-09-07 18:00:29.825 ERROR 24588 --- [io-2001-exec-12] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.829  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-103, 7, -91, -127, 87, 32, 76, 79, -127, 12, 74, 41, -12, 35, -93, 18]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-136870780642854782402843854967538474222]
2019-09-07 18:00:29.830 ERROR 24588 --- [io-2001-exec-15] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.834  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [-23, 68, -58, 29, 71, 93, 79, -8, -108, -122, -62, -39, -19, -45, 58, -50]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [-30215149479868217402650963687137658162]
2019-09-07 18:00:29.835 ERROR 24588 --- [nio-2001-exec-8] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.840  WARN 24588 --- [TaskScheduler-1] o.s.k.r.ReplyingKafkaTemplate            : Reply timed out for: ProducerRecord(topic=d2.checkout-ticket.confirm-request.x, partition=null, headers=RecordHeaders(headers = [RecordHeader(key = kafka_replyTopic, value = [100, 50, 46, 99, 104, 101, 99, 107, 111, 117, 116, 45, 116, 105, 99, 107, 101, 116, 46, 99, 111, 110, 102, 105, 114, 109, 45, 114, 101, 112, 108, 121, 46, 120]), RecordHeader(key = kafka_correlationId, value = [67, -65, 23, -67, 71, 8, 72, -125, -87, 2, -68, -68, 48, -87, -6, 20]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = true), key=null, value=UserRequest(status=null, value=), timestamp=null) with correlationId: [90050485909096564288945114846333630996]
2019-09-07 18:00:29.841 ERROR 24588 --- [nio-2001-exec-3] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:29.849 ERROR 24588 --- [nio-2001-exec-4] o.a.c.c.C.[.[.[/].[dispatcherServlet]    : Servlet.service() for servlet [dispatcherServlet] in context with path [] threw exception [Request processing failed; nested exception is java.util.concurrent.ExecutionException: org.springframework.kafka.KafkaException: Reply timed out] with root cause | org.springframework.kafka.KafkaException: Reply timed out
2019-09-07 18:00:30.170 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 3, CreateTime = 1567854030119, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-54, -43, 82, 53, -106, -10, 64, 42, -111, 3, 27, 1, 105, -80, 111, -64]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/4]  @(1567854030116))) with correlationId: [-70670685138116975917449590312478412864], perhaps timed out
2019-09-07 18:00:31.182 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 4, CreateTime = 1567854031132, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [5, -90, -50, 125, 36, -88, 65, 112, -84, -4, -48, 108, 75, 28, -5, 35]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/5]  @(1567854031130))) with correlationId: [7512249348684896201590100008852323107], perhaps timed out
2019-09-07 18:00:32.333 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 5, CreateTime = 1567854032237, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-42, -40, 20, -92, -121, 77, 71, -65, -103, 41, -65, -115, 62, 77, -3, 72]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/6]  @(1567854032234))) with correlationId: [-54705621018038316085060589515592303288], perhaps timed out
2019-09-07 18:00:33.300 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 6, CreateTime = 1567854033250, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-119, 80, 70, 70, -125, -119, 76, 42, -125, -96, 20, 80, 41, -87, -126, 54]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/7]  @(1567854033248))) with correlationId: [-157761322394370052241853332072867200458], perhaps timed out
2019-09-07 18:00:34.312 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 7, CreateTime = 1567854034261, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-60, -1, -99, -102, -36, -23, 70, -80, -80, 76, 29, -89, -14, -26, 37, 44]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/8]  @(1567854034259))) with correlationId: [-78426447440355055118338155107367639764], perhaps timed out
2019-09-07 18:00:35.320 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 8, CreateTime = 1567854035270, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [66, -57, 47, 85, 111, -71, 65, -46, -118, -39, 94, -27, -67, -15, -21, -92]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/9]  @(1567854035268))) with correlationId: [88763274838874861855148239139787369380], perhaps timed out
2019-09-07 18:00:36.329 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 9, CreateTime = 1567854036279, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [73, 107, 4, 26, 111, -93, 73, -11, -97, 96, 95, -101, -32, 115, -92, -107]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/10]  @(1567854036277))) with correlationId: [97589302680282965518241470628593116309], perhaps timed out
2019-09-07 18:00:37.342 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 10, CreateTime = 1567854037293, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [31, -38, -65, 14, -101, -34, 78, 65, -86, -82, -88, -36, -38, 31, 81, -86]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/11]  @(1567854037290))) with correlationId: [42341863682160484761975282554546114986], perhaps timed out
2019-09-07 18:00:38.352 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 11, CreateTime = 1567854038302, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [15, 30, 123, -57, 122, 67, 79, 64, -98, 98, 88, 34, -97, 29, -122, -12]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/12]  @(1567854038300))) with correlationId: [20096699383153915903553174691179759348], perhaps timed out
2019-09-07 18:00:39.366 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 12, CreateTime = 1567854039315, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-103, 7, -91, -127, 87, 32, 76, 79, -127, 12, 74, 41, -12, 35, -93, 18]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/13]  @(1567854039312))) with correlationId: [-136870780642854782402843854967538474222], perhaps timed out
2019-09-07 18:00:40.377 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 13, CreateTime = 1567854040327, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-23, 68, -58, 29, 71, 93, 79, -8, -108, -122, -62, -39, -19, -45, 58, -50]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/14]  @(1567854040324))) with correlationId: [-30215149479868217402650963687137658162], perhaps timed out
2019-09-07 18:00:41.388 ERROR 24588 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 14, CreateTime = 1567854041339, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [67, -65, 23, -67, 71, 8, 72, -125, -87, 2, -68, -68, 48, -87, -6, 20]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/15]  @(1567854041337))) with correlationId: [90050485909096564288945114846333630996], perhaps timed out


CONSUMER ------------------------------------
2019-09-07 18:00:26.586  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S1/1]  @(1567854026549)
2019-09-07 18:00:27.275 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 0, CreateTime = 1567854027060, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-98, -34, -38, 59, 115, 86, 65, 89, -122, 43, 108, 81, 102, -18, -47, 76]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/1]  @(1567854026549))) with correlationId: [-129107227408876787050099892981093969588], perhaps timed out
2019-09-07 18:00:28.089  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S2/2]  @(1567854028087)
2019-09-07 18:00:28.140 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 1, CreateTime = 1567854028091, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-96, 78, 68, -121, 65, 14, 78, -93, -109, 80, -124, -43, -109, -111, -110, -50]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/2]  @(1567854028087))) with correlationId: [-127199498520597397542583583034621979954], perhaps timed out
2019-09-07 18:00:29.105  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S3/3]  @(1567854029104)
2019-09-07 18:00:29.161 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 2, CreateTime = 1567854029106, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-36, -115, 22, 42, 41, 106, 67, -26, -101, 39, 77, 57, 87, -92, -95, 125]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/3]  @(1567854029104))) with correlationId: [-47119644437792102601022971180987670147], perhaps timed out
	2019-09-07 18:00:30.119  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S1/4]  @(1567854030116)
2019-09-07 18:00:30.171 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 3, CreateTime = 1567854030119, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-54, -43, 82, 53, -106, -10, 64, 42, -111, 3, 27, 1, 105, -80, 111, -64]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/4]  @(1567854030116))) with correlationId: [-70670685138116975917449590312478412864], perhaps timed out
	2019-09-07 18:00:31.132  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S2/5]  @(1567854031130)
2019-09-07 18:00:31.182 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 4, CreateTime = 1567854031132, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [5, -90, -50, 125, 36, -88, 65, 112, -84, -4, -48, 108, 75, 28, -5, 35]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/5]  @(1567854031130))) with correlationId: [7512249348684896201590100008852323107], perhaps timed out
	2019-09-07 18:00:32.236  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S3/6]  @(1567854032234)
2019-09-07 18:00:32.330 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 5, CreateTime = 1567854032237, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-42, -40, 20, -92, -121, 77, 71, -65, -103, 41, -65, -115, 62, 77, -3, 72]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/6]  @(1567854032234))) with correlationId: [-54705621018038316085060589515592303288], perhaps timed out
	2019-09-07 18:00:33.249  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S1/7]  @(1567854033248)
2019-09-07 18:00:33.300 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 6, CreateTime = 1567854033250, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-119, 80, 70, 70, -125, -119, 76, 42, -125, -96, 20, 80, 41, -87, -126, 54]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/7]  @(1567854033248))) with correlationId: [-157761322394370052241853332072867200458], perhaps timed out
2019	-09-07 18:00:34.261  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S2/8]  @(1567854034259)
2019-09-07 18:00:34.311 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 7, CreateTime = 1567854034261, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-60, -1, -99, -102, -36, -23, 70, -80, -80, 76, 29, -89, -14, -26, 37, 44]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/8]  @(1567854034259))) with correlationId: [-78426447440355055118338155107367639764], perhaps timed out
	2019-09-07 18:00:35.269  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S3/9]  @(1567854035268)
2019-09-07 18:00:35.321 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 8, CreateTime = 1567854035270, serialized key size = -1, serialized value size = 56, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [66, -57, 47, 85, 111, -71, 65, -46, -118, -39, 94, -27, -67, -15, -21, -92]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/9]  @(1567854035268))) with correlationId: [88763274838874861855148239139787369380], perhaps timed out
	2019-09-07 18:00:36.278  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S1/10]  @(1567854036277)
2019-09-07 18:00:36.329 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 9, CreateTime = 1567854036279, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [73, 107, 4, 26, 111, -93, 73, -11, -97, 96, 95, -101, -32, 115, -92, -107]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/10]  @(1567854036277))) with correlationId: [97589302680282965518241470628593116309], perhaps timed out
	2019-09-07 18:00:37.292  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S2/11]  @(1567854037290)
2019-09-07 18:00:37.343 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 10, CreateTime = 1567854037293, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [31, -38, -65, 14, -101, -34, 78, 65, -86, -82, -88, -36, -38, 31, 81, -86]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/11]  @(1567854037290))) with correlationId: [42341863682160484761975282554546114986], perhaps timed out
	2019-09-07 18:00:38.301  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S3/12]  @(1567854038300)
2019-09-07 18:00:38.354 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 11, CreateTime = 1567854038302, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [15, 30, 123, -57, 122, 67, 79, 64, -98, 98, 88, 34, -97, 29, -122, -12]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/12]  @(1567854038300))) with correlationId: [20096699383153915903553174691179759348], perhaps timed out
	2019-09-07 18:00:39.314  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S1/13]  @(1567854039312)
2019-09-07 18:00:39.365 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 12, CreateTime = 1567854039315, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-103, 7, -91, -127, 87, 32, 76, 79, -127, 12, 74, 41, -12, 35, -93, 18]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S1/13]  @(1567854039312))) with correlationId: [-136870780642854782402843854967538474222], perhaps timed out
	2019-09-07 18:00:40.325  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S2/14]  @(1567854040324)
2019-09-07 18:00:40.379 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 13, CreateTime = 1567854040327, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [-23, 68, -58, 29, 71, 93, 79, -8, -108, -122, -62, -39, -19, -45, 58, -50]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S2/14]  @(1567854040324))) with correlationId: [-30215149479868217402650963687137658162], perhaps timed out
	2019-09-07 18:00:41.338  INFO 24112 --- [ntainer#0-0-C-1] i.p.services.ReplyingKafkaConsumer       : RECEIVED-REQUEST OK: [REPLY-S3/15]  @(1567854041337)
2019-09-07 18:00:41.388 ERROR 24112 --- [lyContainer-C-1] o.s.k.r.ReplyingKafkaTemplate            : No pending reply: ConsumerRecord(topic = d2.checkout-ticket.confirm-reply.x, partition = 0, offset = 14, CreateTime = 1567854041339, serialized key size = -1, serialized value size = 57, headers = RecordHeaders(headers = [RecordHeader(key = kafka_correlationId, value = [67, -65, 23, -67, 71, 8, 72, -125, -87, 2, -68, -68, 48, -87, -6, 20]), RecordHeader(key = __TypeId__, value = [105, 111, 46, 112, 114, 111, 106, 101, 99, 116, 46, 109, 111, 100, 101, 108, 46, 85, 115, 101, 114, 82, 101, 113, 117, 101, 115, 116])], isReadOnly = false), key = null, value = UserRequest(status=200, value=[REPLY-S3/15]  @(1567854041337))) with correlationId: [90050485909096564288945114846333630996], perhaps timed out

BACKEND ------------------------------------
2019-09-07 18:00:26.549  INFO 4844 --- [nio-2010-exec-1] io.project.resources.TestController      : #S1 REQUEST-1() @1567854026549
2019-09-07 18:00:28.087  INFO 4844 --- [nio-2010-exec-2] io.project.resources.TestController      : #S2 REQUEST-2() @1567854028087
2019-09-07 18:00:29.104  INFO 4844 --- [nio-2010-exec-3] io.project.resources.TestController      : #S3 REQUEST-3() @1567854029104
	2019-09-07 18:00:30.116  INFO 4844 --- [nio-2010-exec-4] io.project.resources.TestController      : #S1 REQUEST-4() @1567854030116
	2019-09-07 18:00:31.130  INFO 4844 --- [nio-2010-exec-5] io.project.resources.TestController      : #S2 REQUEST-5() @1567854031130
	2019-09-07 18:00:32.234  INFO 4844 --- [nio-2010-exec-6] io.project.resources.TestController      : #S3 REQUEST-6() @1567854032234
	2019-09-07 18:00:33.248  INFO 4844 --- [nio-2010-exec-7] io.project.resources.TestController      : #S1 REQUEST-7() @1567854033248
	2019-09-07 18:00:34.259  INFO 4844 --- [nio-2010-exec-8] io.project.resources.TestController      : #S2 REQUEST-8() @1567854034259
	2019-09-07 18:00:35.268  INFO 4844 --- [nio-2010-exec-9] io.project.resources.TestController      : #S3 REQUEST-9() @1567854035268
	2019-09-07 18:00:36.277  INFO 4844 --- [io-2010-exec-10] io.project.resources.TestController      : #S1 REQUEST-10() @1567854036277
	2019-09-07 18:00:37.290  INFO 4844 --- [nio-2010-exec-1] io.project.resources.TestController      : #S2 REQUEST-11() @1567854037290
	2019-09-07 18:00:38.300  INFO 4844 --- [nio-2010-exec-2] io.project.resources.TestController      : #S3 REQUEST-12() @1567854038300
	2019-09-07 18:00:39.312  INFO 4844 --- [nio-2010-exec-3] io.project.resources.TestController      : #S1 REQUEST-13() @1567854039312
	2019-09-07 18:00:40.324  INFO 4844 --- [nio-2010-exec-4] io.project.resources.TestController      : #S2 REQUEST-14() @1567854040324
	2019-09-07 18:00:41.337  INFO 4844 --- [nio-2010-exec-5] io.project.resources.TestController      : #S3 REQUEST-15() @1567854041337